[Rainmeter]
Update=1000
AccurateText=0
DynamicWindowSize=0
Group=PRTSkin | PRTSkinHidable | PRTSkinTerminal

[Metadata]
Name=Rhodes_Island_UI
Author=热心炎国云玩家
Information=让您在PC上也能享受到罗德岛终端系统的交互界面。|作战终端，如果你的作战地点在另一世界的话。
License=Closure Commons 署名-不许获利-传递下去 42.0
Version=0.10.0

[Variables]
@Include1=#@#GlobalVars.inc
@Include2=#@#Includes\Terminal.inc
@Include3=#@#Includes\mSteam.inc
@Include4=#@#Includes\mSysTemp.inc


[TerminalM1]


; "你绝对猜不到我的源石技艺是什么。"
[Terminal]

[TerminalDots]

[TerminalIconDrop]
ImageName=#SteamTerminalIcon#
Hidden=#SteamTerminalHideIconBackdrop#

[Terminal.Bk]

[TerminalIcon]
ImageName=#SteamTerminalIcon#

[TerminalTitle]
Text=#SteamTerminalTitle#

; 当前状态
[TerminalStateBg]

[TerminalState]
Text=#SteamTerminalState#

[TerminalNow]
; MeasureName=mSteamPlaying
Text=#SteamTerminalNowIdle#


; 理智指示器
; 失去理智.png
[TerminalSanBg]

[TerminalSanMax]

[TerminalSanLabel]
Text=#SteamTerminalSanLabel#

[TerminalSanIcon]

[TerminalSanAddBg]

[TerminalSanAddIcon]

[TerminalSan]
MeasureName=mSysTemp1I


; 显示，封面横幅。
[TerminalGame1]
Meter=Image
MeasureName=mRecentGame1Img
SolidColor=34,57,75,255
Padding=0,0,160,0
X=540
Y=([Terminal:H]*0.08)
H=([Terminal:H]*0.80/2)
Container=TerminalMask
LeftMouseDownAction=[Play #BtnSound#]
LeftMouseUpAction=["steam://nav/games/details/[mRecentGame1Id]"]

[TerminalGame2]
Meter=Image
MeasureName=mRecentGame2Img
SolidColor=34,57,75,255
Padding=0,0,160,0
X=0r
Y=([Terminal:H]*0.04)R
H=([Terminal:H]*0.80/2)
Container=TerminalMask
LeftMouseDownAction=[Play #BtnSound#]
LeftMouseUpAction=["steam://nav/games/details/[mRecentGame2Id]"]


; 他戴上了遮罩。
[TerminalMask]


; 装饰线
[TerminalDecoLine]